{
    "id": "missing-library-book",
    "title": "The Case of the Lost Treasure",
    "theme": "Missing Library Book",
    "stories": {
      "simple": "Alex loved the old adventure book about pirates and treasure. But when Alex went to return it to the library, the book was gone! Alex looked everywhere at home but couldn't find it. The librarian said the book was very special and old. Alex decided to be a detective and solve the mystery. Alex made a list of everywhere the book had been. Then Alex remembered reading it at the park yesterday! Alex ran to the park and found the book under the picnic table. The librarian was so happy to get the special book back safely.",
      
      "regular": "Alex had been completely absorbed in reading a rare first-edition adventure novel about maritime treasure hunters when disaster struck - the irreplaceable library book mysteriously vanished. Despite conducting systematic searches throughout the house and retracing recent activities, the precious volume remained missing. The concerned librarian explained that this particular book was part of a limited historical collection with significant cultural value. Determined to solve this puzzling case, Alex implemented proper investigative methodology by documenting all possible locations and circumstances. A careful review of recent reading sessions revealed the crucial clue: yesterday's outdoor reading adventure at the neighborhood park. Racing to the scene, Alex discovered the missing treasure safely hidden beneath the weathered picnic table.",
      
      "challenge": "Alex had been deeply engrossed in a magnificently illustrated first-edition maritime adventure anthology chronicling legendary treasure expeditions when catastrophe befell the literary investigation - the irreplaceable bibliographic artifact had inexplicably disappeared from secure custody. Despite executing comprehensive forensic searches throughout the residential premises and methodically reconstructing chronological activity patterns, the invaluable historical manuscript remained mysteriously absent. The distressed library specialist emphasized the exceptional significance of this particular volume within their specialized rare book collection, noting its considerable historical and monetary value. Employing systematic investigative protocols and deductive reasoning methodologies, Alex meticulously documented potential location hypotheses while analyzing circumstantial evidence patterns. The breakthrough revelation emerged through careful temporal reconstruction of recent reading environments, ultimately leading to the successful recovery of the missing literary treasure from its inadvertent concealment beneath deteriorated recreational facility infrastructure."
    }
  }