{
    "id": "secret-message",
    "title": "The Hidden Code",
    "theme": "Secret Message",
    "stories": {
      "simple": "Maya found a strange note in her locker with weird symbols instead of letters. The message looked like: ★♦▲●◆★♦. Maya was really curious about what it meant! She showed it to her friend Sam who loved puzzles. Sam noticed that each symbol appeared the same number of times as letters in Maya's name. They figured out that each symbol stood for a different letter! When they decoded it, the message said 'MEET ME AT THE OLD OAK TREE.' Maya and Sam went to the tree and found another student who wanted to start a secret puzzle club. The mysterious note was an invitation!",
      
      "regular": "Maya discovered an enigmatic encrypted message concealed within her school locker, featuring an intriguing sequence of geometric symbols that defied immediate interpretation. The cryptographic puzzle presented a fascinating intellectual challenge that immediately captured her analytical curiosity. Collaborating with Sam, whose exceptional pattern recognition abilities complemented Maya's methodical approach, they began systematic cryptanalysis of the symbolic cipher. Through careful frequency analysis and logical deduction, they recognized that the symbol distribution corresponded directly to common English letter patterns. Their collaborative decryption efforts revealed an invitation to join an exclusive problem-solving society that met beneath the historic oak tree. The mysterious message served as both recruitment tool and membership qualification exam.",
      
      "challenge": "Maya encountered a sophisticated cryptographic communication mechanism strategically positioned within her educational facility storage compartment, consisting of an elaborate symbolic substitution cipher that demonstrated considerable intellectual complexity. The meticulously crafted encryption algorithm presented a formidable analytical challenge requiring advanced pattern recognition, frequency analysis, and systematic decryption methodologies. In collaboration with Sam, whose exceptional computational thinking and logical reasoning capabilities provided complementary problem-solving expertise, they initiated comprehensive cryptanalytic investigation protocols. Through implementation of statistical frequency distribution analysis, contextual pattern identification, and iterative hypothesis testing, they successfully decoded the cipher to reveal an exclusive invitation to participate in an underground academic enrichment organization specializing in advanced mathematical and logical problem-solving challenges. This ingenious recruitment mechanism simultaneously served as intellectual assessment tool and membership qualification examination."
    }
  }