{
    "id": "beach-rescue",
    "title": "Dolphin in Trouble", 
    "theme": "Beach Rescue",
    "stories": {
      "simple": "Maya walked on the beach. She saw something big in the sand. It was a dolphin! The dolphin looked sad and scared. Maya ran to get help fast. She found Sam and Alex near the water. They all came back to help. Sam got water in a bucket. Alex called for more help. Maya talked to the dolphin softly. Soon more people came to help. They moved the dolphin back to the water. The dolphin swam away happy. Maya felt really good about helping.",
      
      "regular": "Maya was exploring the sandy beach when she discovered something unexpected. A young dolphin was stranded on the shore, looking frightened and exhausted. Maya felt worried but determined to help. She quickly ran to find Sam and Alex who were collecting shells nearby. Together, they rushed back to the dolphin. Sam carefully poured cool water over the dolphin's skin. Alex contacted the marine rescue team on his phone. Maya gently spoke to the dolphin, trying to keep it calm. When the rescuers arrived, they worked together to safely guide the dolphin back into the ocean. As the dolphin disappeared into the waves, Maya felt incredibly proud of what they had accomplished.",
      
      "challenge": "Maya was leisurely strolling along the pristine coastline when she encountered an extraordinary situation. A magnificent bottlenose dolphin had become stranded on the beach, its breathing labored and its dark eyes reflecting both exhaustion and desperation. Despite feeling overwhelmed by the responsibility, Maya's compassionate nature compelled her to take immediate action. She sprinted across the sand to locate Sam and Alex, who were enthusiastically investigating tide pools in the distance. The three friends collaborated seamlessly, with Sam methodically applying seawater to keep the dolphin's sensitive skin hydrated, while Alex efficiently contacted the local marine mammal rescue organization. Maya positioned herself near the dolphin's head, speaking in soothing tones to minimize its stress during this traumatic experience. When the professional rescue team arrived with specialized equipment, they successfully coordinated the dolphin's return to its natural habitat, and Maya experienced an overwhelming sense of accomplishment and pride."
    }
  }