{
    "id": "lost-whale-rescue",
    "title": "Finding Family",
    "theme": "Lost at Sea",
    "stories": {
      "simple": "Suha heard a sad whale song from her boat. She saw a baby whale swimming alone. It looked scared and lost. Suha called her friend Rishi on the radio. They both looked for the whale's family. Suha played whale sounds from her phone. Soon they heard other whales calling back! The whale family was close by. The baby whale swam fast to its mom. Suha and Rishi felt so happy. They had helped bring a family back together. The whales sang a thank-you song.",
      
      "regular": "Suha detected distressed whale calls while sailing near the coast. She spotted a juvenile humpback whale circling frantically in the open water. The young whale appeared separated from its pod and increasingly agitated. Suha immediately contacted marine rescue operator Rishi via radio. Together, they initiated a coordinated search pattern across the surrounding waters. Using hydrophones, they broadcasted recorded whale songs to attract the missing family. Within an hour, they located the adult whales several miles away. The reunion was emotional as the baby whale rejoined its protective mother. Suha and Rishi witnessed the pod's grateful celebration through their powerful songs.",
      
      "challenge": "Suha intercepted anguished vocalizations from a disoriented juvenile humpback whale during her oceanographic research expedition. The separated calf exhibited clear signs of psychological distress, swimming in repetitive circles while emitting distress calls. Recognizing the critical nature of the situation, Suha collaborated with marine mammal specialist Rishi to implement an emergency reunification protocol. They deployed advanced acoustic equipment to broadcast authentic whale communication patterns across a systematic search grid. Their persistence was rewarded when the adult pod responded from a considerable distance, having been displaced by shipping traffic. The emotional reunion demonstrated the profound social bonds within cetacean families, providing Suha with invaluable data for her marine behavior research."
    }
  }